import React from 'react';

const Blogs = () => {
    return (
        <div className='m-5'>

            <div>
                <div>
                    <h2>Difference between javascript and nodejs</h2>
                    <h4>Javascript</h4>
                    <p>জাভাস্ক্রিপ্ট একটি প্রোগ্রামিং ভাষা যা ওয়েবসাইটে স্ক্রিপ্ট লেখার জন্য ব্যবহৃত হয়। </p>
                    <p>জাভাস্ক্রিপ্ট শুধুমাত্র ব্রাউজারে চালানো যেতে পারে।</p>
                    <p>এটি মূলত ক্লায়েন্ট-সাইডে ব্যবহৃত হয়।</p>
                    <p>জাভাস্ক্রিপ্ট এইচটিএমএল যোগ করতে এবং DOM এর সাথে খেলতে যথেষ্ট সক্ষম।</p>
                    <p>
                        জাভাস্ক্রিপ্ট যেকোন ব্রাউজার ইঞ্জিনে চলতে পারে যেমন সাফারিতে জেএস কোর এবং ফায়ারফক্সে স্পাইডারমনকি।</p>
                </div>
                <div>
                    <h4>NodeJS</h4>
                    <p>নোডজেএস একটি জাভাস্ক্রিপ্ট রানটাইম পরিবেশ।</p>
                    <p>আমরা NodeJS এর ​​সাহায্যে ব্রাউজারের বাইরে Javascript চালাতে পারি।</p>
                    <p>এটি বেশিরভাগই সার্ভার-সাইডে ব্যবহৃত হয়।</p>
                    <p>Nodejs এর HTML ট্যাগ যোগ করার ক্ষমতা নেই।</p>
                    <p>V8 হল node.js এর ভিতরে জাভাস্ক্রিপ্ট ইঞ্জিন যা জাভাস্ক্রিপ্ট পার্স করে এবং চালায়।</p>
                </div>
            </div>
            <div>
                <h3>When should you use nodejs and when should you use mongodb</h3>
                <p><small>একটি ডাটাবেস তৈরি করার সময়, আপনি এটি স্থানীয়ভাবে বা ক্লাউডে সেট আপ করতে বেছে নিতে পারেন। উদাহরণস্বরূপ, আপনি MongoDB-এর লোকালহোস্টে ম্যানুয়ালি MongoDB ডাউনলোড এবং ইনস্টল করে একটি ইনস্টলেশন স্পিন করতে পারেন। যে বলে, একটি ম্যানুয়াল ইনস্টলেশন চলমান রক্ষণাবেক্ষণ এবং রক্ষণাবেক্ষণ খরচ সহ আসে। একজন অ্যাপ্লিকেশন বিকাশকারী হিসাবে, আমি যতটা সম্ভব ম্যানুয়াল কাজ এড়াতে পছন্দ করি, তাই আমি ম্যানুয়াল ইনস্টলেশন থেকে দূরে থাকতে চাই।

                    ক্লাউড অফারগুলির জন্য, মঙ্গোডিবি অ্যাটলাস রয়েছে, মঙ্গোডিবি থেকে ডেটাবেস-এ-এ-সার্ভিস অফার৷ এটি প্ল্যাটফর্ম-অজ্ঞেয়বাদী, যা আপনাকে AWS, Azure এবং Google ক্লাউডে ডাটাবেস ক্লাস্টার তৈরি করতে দেয় এবং স্কেলিং একটি বোতামে ক্লিক করার মতোই সহজ। তারা একটি বিনামূল্যে M0 স্তর সহ শুরু করা সহজ করে দিয়েছে। সাইন আপ থেকে একটি তৈরি ডাটাবেস থাকা পর্যন্ত মোট সময় আমার জন্য পাঁচ মিনিটেরও কম ছিল।</small></p>
            </div>
            <div>
                <h3>Differences between sql and nosql databases.</h3>
                <h4>SQL</h4>
                <p>রিলেশনাল ডাটাবেস ম্যানেজমেন্ট সিস্টেম (RDBMS)</p>
                <p>এই ডাটাবেসের স্থির বা স্থির বা পূর্বনির্ধারিত স্কিমা আছে</p>
                <p>এই ডাটাবেস শ্রেণীবদ্ধ ডেটা সঞ্চয়ের জন্য উপযুক্ত নয়।</p>
                <p>এই ডাটাবেসগুলি জটিল প্রশ্নের জন্য সবচেয়ে উপযুক্ত</p>
                <p>উল্লম্বভাবে মাপযোগ্য</p>
                <h4>NoSQL</h4>
                <p>নন-রিলেশনাল বা ডিস্ট্রিবিউটেড ডাটাবেস সিস্টেম।</p>
                <p>তাদের গতিশীল স্কিমা আছে</p>
                <p>এই ডাটাবেসগুলি শ্রেণীবদ্ধ ডেটা সঞ্চয়ের জন্য সবচেয়ে উপযুক্ত।</p>
                <p>এই ডাটাবেসগুলি জটিল প্রশ্নের জন্য এত ভাল নয়</p>
                <p>অনুভূমিকভাবে মাপযোগ্য</p>
            </div>
        </div>
    );
};

export default Blogs;